pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c

#include "mcc_generated_files/system.h"
#include "mcc_generated_files/mcc.h"
#include "mcc_generated_files/pin_manager.h"
#include  <xc.h>
#include <libpic30.h>
#include "lcd.h"
#include "function.h"

#define RBC_NO_Fault   0
#define RBC_Fault      1
#define EBC_NO_Fault   0      
#define EBC_Fault      1
#define Short_Ckt_Current 42
#define RBC_Maximum_Power 4400
#define Maximum_RBC_Current 36
#define Maximum_Bat_Current 14
#define Minimum_Settable_Bat_Current 10
#define Maximum_OP_Voltage  136
#define Minimum_OP_Voltage  105
#define Maximum_EBC_Voltage 270
#define Minimum_EBC_Voltage 205
#define Maxmium_EBC_OP_Voltage 116
#define EBC_Short_Ckt_Current  24
#define Reverse_Polarity_Detected      1//1
#define Reverse_Polarity_Not_Detected   0//0
#define Maximum_Input_Voltage  270
#define Minimum_Input_Voltage  202
#define CHRG_ON_LED   _LATD8
#define Medium_Range_Bat_Current  33
#define Restricted_EBC_Current  22
#define Positive_Earth_Leakage   1//1
#define Positive_Earth_No_Detected 0//0
#define Negative_Earth_Leakage    1//1
#define Negative_Earth_No_Detected 0//0
#define  DS13070  0xD0
#define  DS13071  0xD1

#include "i2c.h"

int phase_B[110], phase_Y[110], phase_R[110];
int i;
int voltage, voltage1, voltage2;
int RBC_DCV, EBC_DCV, OP_Voltage;
int CT_1 = 0, CT_2, CT_3;
int flag_EBC_Voltage_Crossing=0;
int flag_fault=0;
int flag_scr_trip=0;
int flag_igbt_trip=0;
int counter_fault=1,counter_fault_EBC=1;
float I_B, I_Total;
int counter=1;
int flag_over_detected_voltage=1;
int flag_under_detected;
int flag_over_detected;
float Total_Current, Battery_Current;
int RBC_SP = 122, EBC_SP = 110;
int Battery_Current_SP=10;
int Battery_Current_SP_Enter=10;
int RBC_Enter_SP = 122;
int R_Y, Y_B, B_R;
int e,f;
int counter_ShortCkt=1;
float res;
int hours=12;
int hours_enter=12;
unsigned char dat=0x15;
unsigned char v[10];
unsigned long output[10];
unsigned long current[10];
unsigned long DC[10];
unsigned long current2[10];
unsigned long Power_Var[10];
unsigned long output1[10];
unsigned long v1[10];
unsigned char temp=0x26;
unsigned char time[10];

 RTCTime result;
 unsigned char year;
 unsigned char month;
 unsigned char day;
 unsigned char weekday;
 unsigned char hour;
 unsigned char minutes;
 unsigned char seconds;





void My_Timer_ISR()
{
    init_ADC();

    for (i = 0; i < 110; i++) 
    {
        while (!IFS0bits.AD1IF);
        IFS0bits.AD1IF = 0;
        phase_B[i] = ADC1BUF0; // B-AN0
        phase_Y[i] = ADC1BUF1; // Y-AN1
        phase_R[i] = ADC1BUF2; // R-AN2
        RBC_DCV = ADC1BUF3; // RBC Capacitor voltage
        EBC_DCV = ADC1BUF4; // EBC Capacitor voltage
        //OP_Voltage = ADC1BUF5; // Output voltage
        CT_3 = ADC1BUF5; // spare pin
        CT_2 = ADC1BUF6; 
        CT_1 = ADC1BUF7; 
        OP_Voltage=ADC1BUF8;

        if (phase_B[i] >= phase_B[0])
        {
            phase_B[0] = phase_B[i];
        }


        if (phase_Y[i] >= phase_Y[0]) 
        {
            phase_Y[0] = phase_Y[i];
        }

        if (phase_R[i] >= phase_R[0])
        {
            phase_R[0] = phase_R[i];
        }

        voltage = (phase_B[0] - 2002) / (float) (5.091);
        voltage1 = (phase_Y[0] - 2009) / (float) (5.3008);
        voltage2 = (phase_R[0] - 2005) / (float) (5.3008);
        OP_Voltage = (OP_Voltage)*(0.041);
        I_Total = (CT_2 - 2104) / (5.200);
        I_B = ((CT_1 - 2125) / (5.114)) + 2; // Battery current
        R_Y = voltage + voltage1;
        Y_B = voltage1 + voltage2;
        B_R = voltage2 + voltage;

    }


}

int main(void) 
{

    SYSTEM_Initialize();
    LCD_Init();
    LCD_String_xy(1, 0, "INTRA INDUSTRIES ");
    LCD_String_xy(2, 0, "PVT LTD PUNE");

    TMR1_SetInterruptHandler(My_Timer_ISR);
    TMR1_Start();
    __delay_ms(500);
    LCD_Command(0x01);
    char buffer[10];
    int p, j, l, n, m, a, x, y;
    float k_RBC = 34;
    float k_EBC=25;
    float power_RBC;
    float power_EBC;
    int flag_RBC = 1, flag_EBC = 1, flag_reached_RBC = 0, flag_reached_EBC = 0, s = 8;
    int flag = 0;
    int flag_shut_down=0;
     int flag_shut_down_EBC=0;
     
     TRISDbits.TRISD13=1;            // DC_Coil
     TRISFbits.TRISF12=1;            // IGBT_TRIP
     TRISFbits.TRISF13=1;            // Rectifier_TRIP
    
     TRISDbits.TRISD8=0;             // CHRG_ON_LED
     TRISGbits.TRISG9=0;             // BUZZERI
     
     
     
     
     //I2CInit();
     
     I2CInit();
    DS1307_init();
    //setRTCTime(21,3,15,1,13,36,00);
     //
   
     
     __delay_ms(100);
    while (1) 
    {
        result =  getRTCTime();
        
        
        j = IO_RF5_GetValue();       // ENTER
        l = IO_RG13_GetValue();      // BACK
        n = IO_RA6_GetValue();       // UP
        p = IO_RA7_GetValue();       // DOWN
        
        m = M_RBC_FLT_GetValue();    // RD6-RBC IGBT FAULT
        a = M_EBC_FLT_GetValue();    // RD7-EBC IGBT FAULT
        x = IO_RD4_GetValue();       // Earth_Leakage1
        y = IO_RD5_GetValue();       // Earth_Leakage2
        
        __delay_ms(100);
        
        
        if (n == 0 && p == 1 && flag==2)        // UP button is pressed
        {
            RBC_SP++;
            
        }
        else if (n == 1 && p == 0 && flag==2)   // DOWN BUTTON IS pressed
        {
            RBC_SP--;
            
        }
        
/******************************************************************************/   
        
        
        /*Settable Battery current*/
        
        else if(n==0 && p==1 && flag==5)        // UP button is pressed
        {
           Battery_Current_SP++;
        }
        
        else if(n==1 && p==0 && flag==5)        // Down button is pressed
        {
            Battery_Current_SP--;
        }
        
        
        else if(n==0 && p==1 && flag==6)
        {
            hours++;
        }
        
        else if(n==1 && p==0 && flag==6)
        {
            hours--;
        }
        
        
        
        
/*******************************************************************************/
        /*RBC Output voltage limit*/
        
        if (RBC_SP > 135)                       // Over-voltage
        {
            RBC_SP = 135;
        }
        
        else if (RBC_SP < 110)                  // Under-voltage
         {
            RBC_SP = 110;
        }
        
        
/********************************************************************************/  
        
