pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c
        /*Battery current limit*/
        
        if(Battery_Current_SP>14)              // Over-current
        {
            Battery_Current_SP=14;
        }
        else if(Battery_Current_SP<10)         // Under-current
        {
            Battery_Current_SP=10;
        }
        
        
/************************************************************************/               
        if(hours>24)
        {
            hours=24;
        }
        else if(hours<0)
        {
            hours=0;
        }
        /*Enter button is pressed*/
        
        if (j == 0 && flag==2) 
        {
            RBC_Enter_SP = RBC_SP;
        }
        
        else if(j==0 && flag==5)
        {
            Battery_Current_SP_Enter=Battery_Current_SP;
        }
        
/******************************************************************************/        
        else   if(j==0 && flag==6)
        {
            hours_enter=hours;
        }
        
        
       
        
        
           /*Earth Leakage*/
        
        if(x==Positive_Earth_Leakage)
        {
            IO_RA14_SetHigh();          // Positive_Earth_Leakage                      
        }
        
             else
            {
                IO_RA14_SetLow();
            }
        
        
       if(y==Negative_Earth_Leakage)
        {
            IO_RA5_SetHigh();            // Negative_Earth_Leakage
        }
        
             else
            {
                IO_RA5_SetLow();
            }
        
        
       if(x==Positive_Earth_No_Detected && y==Negative_Earth_No_Detected)
        {
            IO_RA4_SetHigh();            // Both_Earth_Leakage          
        }
       else if(x==Positive_Earth_Leakage || y==Negative_Earth_Leakage)
        {
            IO_RA4_SetLow();
            
        }
       
/*********************************************************************************/        
        
       
        /**** Detection of single phase***/
        
        if((voltage >=Maximum_Input_Voltage && voltage2>=Maximum_Input_Voltage ) || (voltage>=Maximum_Input_Voltage && voltage1>=Maximum_Input_Voltage) || (voltage1>=Maximum_Input_Voltage && voltage2>=Maximum_Input_Voltage))
        {
            IO_RA15_SetLow();
            //PWM_EBC_Shut_Down();
        }
        else   if((voltage <=Minimum_Input_Voltage && voltage2<=Minimum_Input_Voltage ) || (voltage<=Minimum_Input_Voltage && voltage1<=Minimum_Input_Voltage) || (voltage1<=Minimum_Input_Voltage && voltage2<=Minimum_Input_Voltage))
        {
            IO_RA15_SetHigh();
            //PWM_EBC_Shut_Down();
        }
    /****** Detection of over-voltage*******/    
       
        else if((voltage >=Maximum_Input_Voltage && voltage2>=Maximum_Input_Voltage ) || (voltage>=Maximum_Input_Voltage && voltage1>=Maximum_Input_Voltage) || (voltage1>=Maximum_Input_Voltage && voltage2>=Maximum_Input_Voltage))
        {
            IO_RA15_SetLow();
            //PWM_EBC_Shut_Down();
        }
        
        
        
        else
        {
            IO_RA15_SetLow();
        }
       /* else
        {
            IO_RA15_SetLow();
        }*/
        
        
        
/******************************************************************************/
        
        /*Set point increment and Decrement*/
        
        if((voltage<=Minimum_Input_Voltage)||(voltage1<=Minimum_Input_Voltage )||(voltage2<=Minimum_Input_Voltage)&&(flag_over_detected_voltage==0))
        {
           // LCD_Command(0x01);
            __delay_ms(10);
            LCD_String_xy(1,0,"Under Voltage");
            __delay_ms(100);
            flag_over_detected_voltage=1;
        }
        else if((voltage>=Maximum_Input_Voltage)||(voltage1>=Maximum_Input_Voltage)||(voltage2>=Maximum_Input_Voltage))
        {
            LCD_Command(0x01);
             __delay_ms(10);
            LCD_String_xy(1,0,"Over Voltage");
            __delay_ms(100);
        }
        
/*******************************************************************************/        
       
        /* SCR and IGBT trip*/
       
        if(flag_scr_trip==1)
        {
            LATGbits.LATG9=1;              // Buzzer
             LCD_Command(0x01);
             __delay_ms(10);
            LCD_String_xy(1,0,"SCR TRIP");
            __delay_ms(100);
            flag_scr_trip=0;
            //flag_scr_trip=0;
        }
        
        if(flag_igbt_trip==1)

        {
            LATGbits.LATG9=1;              // Buzzer
            LCD_Command(0x01);
             __delay_ms(10);
            LCD_String_xy(1,0,"IGBT TRIP");
            __delay_ms(100);
            flag_igbt_trip=0;
            //flag_igbt_trip=0;
        }
        
        
       
/******************************************************************************/        
        
      
/******************************************************************************/        
       
        /*Y-phase is absent*/
        
        if((voltage1==0)||(voltage1>=Maximum_Input_Voltage))
       {
           PWM_RBC_Shut_Down();
           PWM_EBC_Shut_Down();
           LCD_Command(0x01);
            __delay_ms(10);
           LCD_String_xy(1,0,"Y-Phase Absent");
           __delay_ms(100);  
           
       }
       
/*********************************************************************************/        
       
        if( flag_over_detected==1)
        {
            LCD_Command(0x01);
            __delay_ms(10);
           LCD_String_xy(1,0,"Over_Voltage in Phase ");
           __delay_ms(100);
        }
        
        if(flag_under_detected==1)
        {
            LCD_Command(0x01);
            __delay_ms(10);
           LCD_String_xy(1,0,"Under_Voltage in Phase");
           __delay_ms(100);
        }
        
                            
        power_RBC = OP_Voltage*I_Total;
        power_EBC=OP_Voltage*I_Total;

        
        
/*******************************************************************************/        
                          
                      /*RBC MODE*/

        
if ((voltage >Minimum_Input_Voltage && voltage<Maximum_Input_Voltage)&&(voltage1 > Minimum_Input_Voltage &&  voltage1<Maximum_Input_Voltage)&&(voltage2 > Minimum_Input_Voltage && voltage2<Maximum_Input_Voltage)) 
{
            
    
