pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c
            if(PORTDbits.RD13==Reverse_Polarity_Detected)
            {
                LCD_Command(0x01);
                __delay_ms(10);
                PWM_RBC_Shut_Down();
                LCD_String_xy(1,0,"Bat_Rev_Polarity");
                LATGbits.LATG9=1;
                while(1);
            }
               
            
            PWM_EBC_Shut_Down();
            IO_RA2_SetLow();
            IO_RA15_SetLow();

/**************** Power sequence for RBC ****************************************/
            
            if (flag_RBC == 1) 
            {
               
                ALL_RELAY_OFF();
                __delay_us(1);
                RBC_POWER_SEQ();
                flag_RBC = 0;
            }
            
/******************************************************************************/           
            
            if((PORTFbits.RF12==0)&&(flag_scr_trip==0))
            {
               // LATGbits.LATG9=1;
                
                 
                PWM_RBC_Shut_Down();
                flag_scr_trip=1;
               
            }
            if((PORTFbits.RF13==0) &&(flag_igbt_trip==0))
            {
               /* LCD_Command(0x01);
                __delay_ms(100);*/
                 //LATGbits.LATG9=1;
               
                PWM_RBC_Shut_Down();
                 flag_igbt_trip=1;
               
            }
            
            if((m==RBC_Fault) && (counter_fault!=0))
            {
                if(counter_fault==1)
                {
                    if(m==RBC_Fault)
                    {
                        LCD_Command(0x01);
                        __delay_ms(10);
                        PWM_RBC_Shut_Down();
                         
                        LCD_String_xy(1,1,"Fault Detected");
                       // __delay_ms(10);
                        counter_fault++;
                    }
                    else
                    {
                        counter_fault=0;
                    }
                }
                else if(counter_fault==2)
                {
                    if(m==RBC_Fault)
                    {
                         LCD_Command(0x01);
                         __delay_ms(10);
                        PWM_RBC_Shut_Down();
                        
                        LCD_String_xy(1,1,"Fault Detected");
                        //__delay_ms(100);
                        counter_fault++;
                    }
                    else 
                    {
                        counter_fault==0;
                    }
                }
                else if(counter_fault==3)
                {
                    if(m==RBC_Fault)
                    {
                        LCD_Command(0x01);
                        __delay_ms(10);
                        LCD_String_xy(1,0,"Fault Detected");
                        PWM_RBC_Shut_Down();
                        LATGbits.LATG9=1;
                        while(1);
                    }
                    else
                    {
                        counter_fault=0;
                        
                    }
                }
                    }
                
            
            
            else if(m==RBC_NO_Fault)
            {
                                       
             if((PORTFbits.RF12==1)&&(PORTFbits.RF13==1))
            {
                                                                                                                         
            if((I_Total>=Short_Ckt_Current) && (counter_ShortCkt!=0) &&(flag_shut_down==0))
            {
                
                //PWM_RBC_Shut_Down();
                if( counter_ShortCkt==1)
                {
                    if(I_Total>=Short_Ckt_Current)
                    {
                        PWM_RBC_Shut_Down();
                        
                        __delay_ms(1000);
                        counter_ShortCkt++;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    }
                }
                else if(counter_ShortCkt==2)
                {
                   if(I_Total>=Short_Ckt_Current)
                    {
                        PWM_RBC_Shut_Down();
                        __delay_ms(1000);
                        counter_ShortCkt++;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    } 
                }
                
                else if(counter_ShortCkt==3)
                {
                   if(I_Total>=Short_Ckt_Current)
                    {
                       PWM_RBC_Shut_Down();
                       flag_shut_down=1;
                       //break;
                        //__delay_ms(5000);
                       // break;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    } 
                }
            }
                
                if(flag_shut_down==1)
                {
                     LATGbits.LATG9=1;
                     LCD_Command(0x01);
                     __delay_ms(10);
                     LCD_String_xy(1,1,"Short circuit");
                    PWM_RBC_Shut_Down();
                   
                }
                                                                                   
        else if(I_Total<Short_Ckt_Current || (counter_ShortCkt==0))
            {
                                    
           PWM_RBC_MODE();
          /*if(I_Total>=39 && I_Total<=42)
           {
               __delay_ms(60000);
               k_RBC=k_RBC-1;
               PWM_Duty_Cycle_RBC(k_RBC);
               if(k_RBC>45)
               {
                   k_RBC=45;
                  
               }
               else if(k_RBC<8)
               {
                   k_RBC=8;
               }
                       
           }*/
           
          /* else if(I_Total>Maximum_RBC_Current)
           {f
              k_RBC=k_RBC-0.5;
               PWM_Duty_Cycle_RBC(k_RBC);
               if(k_RBC>45)
               {
                   k_RBC=45;
                  
