pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c
               }
               else if(k_RBC<8)
               {
                   k_RBC=8;
               }
               
           }*/

            // PWM_Duty_Cycle_RBC(10);

           
            
              if((R_Y >=540) || (Y_B>=540) || (B_R>=540) &&(flag_over_detected==0))
            {
                
                   
                  PWM_RBC_Shut_Down();
                  flag_over_detected=1;
            }
              else if((R_Y <=404) || (Y_B<=404) || (B_R<=404) && (flag_under_detected==0))
            {
                
                PWM_RBC_Shut_Down();
                flag_under_detected=1;
                
            }
           if(result.hour>=(hours_enter) && result.hour<=(hours_enter+1))
        {
            PWM_RBC_Shut_Down();
            if(OP_Voltage<Minimum_OP_Voltage)
            {
                IO_RA3_SetHigh();
            }
            
            if(OP_Voltage<=Minimum_OP_Voltage)
            {
                continue;
            }
            else
            {
                IO_RA3_SetLow();
            }
            
        }
           
              else if(I_B>=Maximum_Bat_Current)
              {
                  
                  k_RBC=k_RBC-0.5;
                   if (k_RBC > 45) 
                {
                    k_RBC = 45;
                } 
                else if (k_RBC < 8)
                {
                    k_RBC= 8;
                }

                PWM_Duty_Cycle_RBC(k_RBC);
                  
              }
           else if(I_B>=Medium_Range_Bat_Current && I_B<=Maximum_Bat_Current)
                  {
                      
                      
                      if(k_RBC>45)
                      {
                          k_RBC=45;
                      }
                      else if(k_RBC<8)
                      {
                          k_RBC=8;
                      }
                      
                      PWM_Duty_Cycle_RBC(k_RBC);
                  }
            else if (I_Total>=Maximum_RBC_Current) 
            {
                k_RBC =k_RBC - 0.5;
                if (k_RBC > 45) 
                {
                    k_RBC = 45;
                } 
                else if (k_RBC < 8)
                {
                    k_RBC= 8;
                }

                PWM_Duty_Cycle_RBC(k_RBC);


            }
            else if((I_B>=Minimum_Settable_Bat_Current) && (I_B<=15) && (flag==5))
            {
             if(Battery_Current_SP_Enter>I_B)
            {
                k_RBC=k_RBC+0.5;
                if(k_RBC>45)
                {
                    k_RBC=45;
                }
                else if(k_RBC<8)
                {
                    k_RBC=8;
                }
                PWM_Duty_Cycle_RBC(k_RBC);
            }
             
             else if(Battery_Current_SP_Enter<I_B)
             {
                 k_RBC=k_RBC-0.5;
                 if(k_RBC>45)
                {
                   k_RBC=45;
                }
                else if(k_RBC<8)
                {
                    k_RBC=8;
                }
                PWM_Duty_Cycle_RBC(k_RBC);
            }
                 
             }
            
           
            else if (RBC_Enter_SP > OP_Voltage) 
            {
                k_RBC = k_RBC + 0.5;

                if (k_RBC > 45) 
                {
                    k_RBC = 45;
                } 
                else if (k_RBC < 8) 
                {
                    k_RBC = 8;
                }

                PWM_Duty_Cycle_RBC(k_RBC);

            }
            
            
            else if(OP_Voltage>=Maximum_OP_Voltage)
            {
                __delay_ms(2000);
                 LATGbits.LATG9=1;
                PWM_RBC_Shut_Down();
                while(1);
            }
            

            else if (RBC_Enter_SP < OP_Voltage) 
            {
                k_RBC = k_RBC - 0.5;
                if (k_RBC > 45) 
                {
                    k_RBC = 45;
                }
                else if (k_RBC < 8) 
                {
                    k_RBC = 8;
                }
                PWM_Duty_Cycle_RBC(k_RBC);
            }
            else if (RBC_Enter_SP == OP_Voltage)
            {
                if (k_RBC > 45)
                {
                    k_RBC = 45;
                } 
                else if (k_RBC < 8) 
                {
                    k_RBC = 8;
                }
                PWM_Duty_Cycle_RBC(k_RBC);
            }

        }
             }
             }

            flag_EBC = 1;
        }
        
/*********************END RBC MODE**********************************************/       
           
                     /*EBC MODE*/

else 
        {
                         
            PWM_RBC_Shut_Down();
            if(PORTDbits.RD13==Reverse_Polarity_Detected)
            {
                LCD_Command(0x01);
                PWM_EBC_Shut_Down();
                LATGbits.LATG9=1;
                LCD_String_xy(1,1,"Reverse Polarity Detected");
                while(1);
            }

            /*Power sequence for EBC*/
            if (flag_EBC == 1) {
                ALL_RELAY_OFF();
                __delay_us(10);
                EBC_POWER_SEQ();
                flag_EBC = 0;

            }
            IO_RA2_SetHigh(); // SP_LED
            
            if((PORTFbits.RF12==0))
            {
                PWM_EBC_Shut_Down();
            }
            if(PORTFbits.RF13==0)
            {
                PWM_EBC_Shut_Down();
            }
            
            
            
            
        
             if((a==EBC_Fault) && (counter_fault_EBC!=0))
            {
                
                if(counter_fault_EBC==1)
                {
                    if(a==EBC_Fault)
                    {
                        PWM_EBC_Shut_Down();
                       // __delay_ms(10);
                        counter_fault_EBC++;
                    }
                    else
                    {
                        counter_fault_EBC=0;
                    }
                }
                else if(counter_fault_EBC==2)
                {
                    if(a==EBC_Fault)
                    {
                        PWM_EBC_Shut_Down();
                        //__delay_ms(100);
                        counter_fault_EBC++;
                    }
                    else 
                    {
                        counter_fault_EBC==0;
                    }
                }
                else if(counter_fault_EBC==3)
                {
                    if(a==EBC_Fault)
                    {
                        PWM_EBC_Shut_Down();
                        while(1);
                    }
                    else
                    {
                        LCD_Command(0x01);
                        LCD_String_xy(1,1,"Fault Detected");
                        counter_fault_EBC=0;
                        
