pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c
                    }
                }
                    }
            
             else if((a==EBC_NO_Fault))
            {
             if((PORTFbits.RF12==1)&&(PORTFbits.RF13==1))
            {
                             
             // IO_RA15_SetHigh();
                     
            PWM_EBC_MODE();
           // PWM_Duty_Cycle_EBC(10);


           if((I_Total>=EBC_Short_Ckt_Current) && (counter_ShortCkt!=0) &&(flag_shut_down_EBC==0))
            {
                
                //PWM_RBC_Shut_Down();
                if( counter_ShortCkt==1)
                {
                    if(I_Total>=EBC_Short_Ckt_Current)
                    {
                        PWM_EBC_Shut_Down();
                        
                        __delay_ms(1000);
                        counter_ShortCkt++;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    }
                }
                else if(counter_ShortCkt==2)
                {
                   if(I_Total>=EBC_Short_Ckt_Current)
                    {
                        PWM_EBC_Shut_Down();
                        __delay_ms(1000);
                        counter_ShortCkt++;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    } 
                }
                
                else if(counter_ShortCkt==3)
                {
                   if(I_Total>=EBC_Short_Ckt_Current)
                    {
                       PWM_EBC_Shut_Down();
                       flag_shut_down_EBC=1;
                       //break;
                        //__delay_ms(5000);
                       // break;
                    }
                    else
                    {
                        counter_ShortCkt=0;
                    } 
                }
            }
                
                if(flag_shut_down_EBC==1)
                {
                    PWM_EBC_Shut_Down();
                   
                }
           
            else if((I_Total<EBC_Short_Ckt_Current) || (counter_ShortCkt==0))
            {

            if(I_Total>=Restricted_EBC_Current)
            {
                k_EBC=k_EBC-0.5;
                if(k_EBC>40)
                {
                    k_EBC=40;
                }
                else if(k_EBC<7)
                {
                    k_EBC=7;
                }
                PWM_Duty_Cycle_EBC(k_EBC);
            }
            
            
            else if(voltage1>=Maximum_EBC_Voltage)
            {
                //IO_RA2_SetLow();
                IO_RA2_SetLow();
               // IO_RA15_SetLow();
                PWM_EBC_Shut_Down();
            }
            else if(voltage1<=Minimum_EBC_Voltage)
            {
                IO_RA2_SetLow();
                //IO_RA15_SetLow();
                PWM_EBC_Shut_Down();
            }
            
            
            
            else if((OP_Voltage>=Maxmium_EBC_OP_Voltage)&& (counter!=0) &&(flag_EBC_Voltage_Crossing==0))
            { 
                if(counter==1)
                {
                    if(OP_Voltage>=Maxmium_EBC_OP_Voltage)
                    {
                        PWM_EBC_Shut_Down();
                        __delay_ms(1000);
                        counter++;
                        
                    }
                    else
                    {
                        counter=0;
                    }
                }
                else if(counter==2)
                {
                   if(OP_Voltage>=Maxmium_EBC_OP_Voltage)
                    {
                        PWM_EBC_Shut_Down();
                        __delay_ms(1000);
                        counter++;
                        
                    }
                    else
                    {
                        counter=0;
                    } 
                }
                else if(counter==3)
                {
                   if(OP_Voltage>=Maxmium_EBC_OP_Voltage)
                    {
                        PWM_EBC_Shut_Down();
                        flag_EBC_Voltage_Crossing=1;
                        
                    }
                    else
                    {
                        counter=0;
                    } 
                } 
            }
                
               // PWM_EBC_Shut_Down();
            
            else if(flag_EBC_Voltage_Crossing==1)
            {
                PWM_EBC_Shut_Down();
            }
                       
            else if ((EBC_SP > OP_Voltage)||(OP_Voltage<=105)) 
            {
                    k_EBC = k_EBC + 0.5;
                    
                    if (k_EBC > 40) 
                    {
                        k_EBC = 40;
                    } 
                    else if ( k_EBC < 7) 
                    {
                         k_EBC = 7;
                    }
                    
                        PWM_Duty_Cycle_EBC( k_EBC);
                    }
                
                else if (EBC_SP < OP_Voltage) 
                {
                     k_EBC =  k_EBC - 0.5;
                    if ( k_EBC > 40) 
                    {
                         k_EBC = 40;
                    } 
                    else if ( k_EBC< 7) 
                      {
                         k_EBC = 7;
                    }
                    PWM_Duty_Cycle_EBC( k_EBC);
                }
                else if (EBC_SP == OP_Voltage)
                {
                    if (k_EBC > 40) 
                    {
                        k_EBC = 40;
                    } 
                    else if ( k_EBC < 7)
                    {
                         k_EBC = 7;
                    }
                    PWM_Duty_Cycle_EBC( k_EBC);
                }
            }
                       
             }
             }

           
            flag_RBC = 1;

        }
        
        if (l == 0) // BACK button is pressed
        {
            flag = flag + 1;
            if (flag >= 8) 
            {
                flag = 0;
            }
        }
        if (flag == 1) 
        {
            LCD_Command(0x01);
            __delay_ms(1);
            //LCD_String_xy(1,0,"Input_voltage:");

            // LCD_String_xy(1,0,"CT2:");
            sprintf(current, "%.1f", I_B);
            LCD_String_xy(1, 0, current);


            sprintf(Power_Var, "%.1f",power_RBC);
            LCD_String_xy(1,5,Power_Var);

            //LCD_String_xy(1,11,"DC:");
            sprintf(DC, "%.1f", k_RBC);
            LCD_String_xy(1, 11, DC);

