pranavshah101/Project_dspic33ep512mu810/PWM22.X/main.c
            //LCD_String_xy(2,0,"CT2:");
            sprintf(current2, "%.1f",I_Total);
            LCD_String_xy(2, 0, current2);

            sprintf(output, "%d", OP_Voltage);
            LCD_String_xy(2, 10, output);

            sprintf(v, "%d", RBC_SP);
            LCD_String_xy(2, 4, v);

            __delay_ms(30);
        }
        if (flag == 3) 
        {

            LCD_Command(0x01);
            __delay_ms(1);
            LCD_String_xy(1, 1, "RBC_SP:");
            sprintf(v, "%d", RBC_SP);
            LCD_String_xy(1, 10, v);


            LCD_String_xy(2, 1, "OP_VOLTAGE:");
            sprintf(output, "%d", OP_Voltage);
            LCD_String_xy(2, 12, output);

            __delay_ms(30);

        }

        if (flag == 0)
        {
            LCD_Command(0x01);
            __delay_ms(1);


            LCD_String_xy(1, 0, "PH_B=");
            sprintf(data, "%d", voltage); // Displaying phase B
            LCD_String_xy(1, 5, data);


            LCD_String_xy(1, 9, "P_Y=");
            sprintf(data1, "%d", voltage1); // Displaying phase Y
            LCD_String_xy(1, 13, data1);


            LCD_String_xy(2, 0, "PH_R=");
            sprintf(data2, "%d", voltage2); // Displaying phase R
            LCD_String_xy(2, 5, data2);
            __delay_ms(1);
        }

        if (flag == 4) {
            LCD_Command(0x01);
            __delay_ms(1);
            LCD_String_xy(1, 1, "EBC_SP:");
            sprintf(v, "%d", EBC_SP);
            LCD_String_xy(1, 10, v);


            LCD_String_xy(2, 1, "OP_VOLTAGE:");
            sprintf(output, "%d", OP_Voltage);
            LCD_String_xy(2, 12, output);

            __delay_ms(30);
        }
        
        
        if(flag==5)
        {
            LCD_Command(0x01);
            __delay_ms(1);
            LCD_String_xy(1,1,"I_Bat_SP:");
            sprintf(v1,"%d",Battery_Current_SP);
            LCD_String_xy(1,12,v1);
            
            LCD_String_xy(2, 1, "I_Bat:");
            sprintf(output1, "%.1f",I_B);
            LCD_String_xy(2, 12, output1);
            
            __delay_ms(30);

    }
        
        if(flag==2)
        {
           sprintf(current, "%.1f", I_B);
            LCD_String_xy(1, 0, current);


            sprintf(Power_Var, "%.1f",power_EBC);
            LCD_String_xy(1,5,Power_Var);

            //LCD_String_xy(1,11,"DC:");
            sprintf(DC, "%.1f", k_EBC);
            LCD_String_xy(1, 11, DC);

            //LCD_String_xy(2,0,"CT2:");
            sprintf(current2, "%.1f", I_Total);
            LCD_String_xy(2, 0, current2);

            sprintf(output, "%d", OP_Voltage);
            LCD_String_xy(2, 10, output);

            sprintf(v, "%d", EBC_SP);
            LCD_String_xy(2, 4, v);

            __delay_ms(30);
            
           
        }
        
        if(flag==6)
        {
            LCD_Command(0x01);
            __delay_ms(1);
            LCD_String_xy(1,1,"Set time:");
            sprintf(buffer,"%d",hours);
            LCD_String_xy(1,11,buffer);
            sprintf(time,"%d",result.hour);
            LCD_String_xy(2,1,time);
            LCD_String_xy(2,4,":");
             sprintf(time,"%d",result.minute);
            LCD_String_xy(2,5,time);
            LCD_String_xy(2,7,":");
             sprintf(time,"%d",result.second);
            LCD_String_xy(2,9,time);
            
            __delay_ms(30);
            
        }

        
       
        
        
        
}
}
